""" student:shani dihorker
Assigment no.1
program: stars"""
"""
"""

def stars():
    n = int(input("please enter a n:")) #קליטת משתמש ע"י int(input) ונגדיר משתנה חדש להיות n
    if 3 < n < 20: #בדיקה האם הערך שנקלט מהמשתמש הוא בין 3 ל-20
        print(n * "*") #עבור ההדפסה של הצלע העליונה של המלבן
        print("*" + " " * (n - 2) + "*") #צלע ימנית וצלע שמאלית של המלבן ו-(n-2) הוא עבור כמות הרווחים
        print("*" + " " * (n - 2) + "*") #צלע ימנית וצלע שמאלית של המלבן ו-(n-2) הוא עבור כמות הרווחים
        print(n * "*") #עבור ההדפסה של הצלע התחתונה

    else: #במקרה שהקלט לא מקיים את התנאי
        print("Error, try again") #הדפסת הודעת שגיאה

def main():
    stars()

main()
